public class se_media03 {
    public static void main(String[] args){
        // 304호에서 했다
        // 問題 3 難易度 ★
        //問 1
        //① 整数型の変数 age を宣言し、自分の年齢を代入してください。
        //② 文字(char)型の変数 unit を宣言して、「才」を代入してください。
        //③ 文字列(String)型の変数 name を宣言して、自分の氏名を代入してください。
        //④ 上記の変数を使用して「**才の****さん、こんにちは。」と出力してください。
        //
        //問 2
        //① 整数型の変数 nowYear を宣言して、現在の西暦を代入してください。
        //② 整数型の変数 nextCentury を宣言して、2101 を代入してください。
        //③ 上記の変数を使って「22 世紀まであと、**年です。」と出力してください。
        //④ 上記の変数を使って「****さんは 22 世紀には**才ですね。」と出力してください。
        //
        //問 3
        //① 20億に10億を足した数値を表示してください
        //　 (よくある間違い)↓
        //　 System.out.println(2000000000 + 1000000000);
        //
        //問 4
        //① 0.1 に 0.2 を足した数値を表示してください
        //　 (誤答ではないが注意すべき例)↓
        //　 浮動小数の計算は誤差が発生します。気を付けましょう。

    }
}
